[
  {
    "id": 1,
    "title": "Don’t let perfect be the enemy of good",
    "content": "**\"Don’t let perfect be the enemy of good.\"**\n\nI’ve heard this phrase an infinite number of times in the span of this past week. The first time was through my manager; the second, in a management book that I’m reading for professional development; the third, in a podcast that tackles a variety of subjects around feminism and life (this one was about interior design). The remaining times I’ve heard this phrase this past week have been in my head, a consistent reminder to let go of my innate, frequently inhibiting, drive to only serve up instant perfection, and instead take steps to be good, and then better.\n\nThis expression has been most salient in my recent weeks as a program manager for an educational nonprofit. On a normal basis, full-time software engineers are connected to classrooms to teach introductory web development to students. As schools have closed down, I have had to think through ways to continue keeping students and volunteers engaged and connected to the organization.\n\nThe perfectionist in me gave myself two entire weeks to plan through how I could implement my first, seamless virtual class. I wanted to make sure I had the solution to every potential obstacle and loophole I could percieve, from ensuring my students were emotionally and technologically ready (“How must they be feeling right now? Is it to early to make them learn?! Do they all have an internet connection?”), to making certain that my two-hour lesson would flow flawlessly from one section to the next. However, with a push from my manager, I had, not two weeks, but two days to pull it together.\n\nI led my first online class this past Tuesday. Here are my biggest takeways from leading this virtual class:\n\n### **Utilize routines that are already familiar to your students, and adapt them to the technology.**\n\nWhen students walk into your physical classroom, there are immediate structures that they know they must do immediately. Setting up your virtual classroom space will require the same amount of routine establishment, but if you start with what is familiar to your students, there will be entire aspects to it that won’t require any mental lift. When I was teaching math to high school English Language Learners, routine was everything, especially given the language barriers that often added an extra challenge to redirection or introduction of new instructions.\n\nYou can create a slide deck through Powerpoint or [Google Slides](https://docs.google.com/presentation/u/0/?tgif=d) - students will be greeted by their Do Now’s in the same way that they are greeted by a presentation in class. Last week, I utilized the “Share my Screen” function to live code with students to debrief during practice. I had students share out both by cold-calling (“unmute your mics!”), and by typing in the chat box. In an in-person classroom, volunteers support student project work time in small groups. [Zoom has a “Breakout rooms” functionality](https://support.zoom.us/hc/en-us/articles/206476313-Managing-Breakout-Rooms) that can be taken advantage of for this purpose. Since I did it on Google Hangouts, I created four separate [Google Hangouts](https://meet.google.com/) on my Google Calendar that students would be able to join when it was time for small groups. (I learned here that I would need to invite my volunteer participants first, so that they could let the students into the room.)\n\n### **Norm on and optimize student participation.**\n\nThis entails making instructions, expectations, and materials as clear as possible for students. Here are the ways I found were effective:\n\n#### 1) Establish virtual classroom norms.\n\nAt the beginning of class, after they had completed their (familiarly structured) Do Nows, we talked through and I showed some norms of a virtual classroom: having students mute their mics in whole-group time and encouraging familiarity with the chat box (ask questions! participate!) were two key ones. Reiterate: *ask questions when you have them!*\n\n#### 2) Make links as easy as possible for you and your students to access.\n\nI utilized the students’ usual virtual agenda to link every single resource, activity, small group session (via Hangout link), and even to the virtual classroom itself, so that students would have easy access to them. In the same vein, you can create and share a Google Doc to your students that includes agenda items along with which links they need to access. I learned here that it is also helpful to send them out in the chat box when it is time for the students to access them immediately.\n\n#### 3) Set timing and accountability checks.\n\nIt admittedly feels really weird to lead a virtual classroom, in that I feel like I am doing most of the participating, even if that is far from true. As you would in a normal classroom, time box your independent activities and step in to give time checkpoints. Check on student progress by being very clear about how they will be checking in - “When you’re done with Exercise 1, type “Done with Exercise 1!” in the chat box”. That way, you can also more personally check in with students who haven’t met the checkpoint, especially since you cannot physically see their work.\n\n#### 4) Minimize tab management by creating a shared Google Document for the class.\n\nWhen I used one [Google Document](https://docs.google.com/document/u/0/?tgif=d) to keep track of agenda items & links, notes, highlights, or coding answers after we’ve debriefed, students found it much easier to navigate their on-screen classrooms. You can even copy & paste screenshots of your own or student work on this document. The skill of managing many tabs is one we often take for granted. Both the obstacle of going from one webstie tab to another and the bumps along the way due to slower internet connections made me realize halfway through that I can’t lead a virtual classroom with the same assumptions of “students keeping up” as I do in a physical classroom.\n\n### **Garner feedback, reflect, and iterate for next time.**\n\nIn the last 5 minutes of class, I asked my students and volunteers for feedback. Most of my students found the virtual class “cool” or “interesting”. Especially now that students have very little face time with their communities, continuing to teach them and show support for them can be incredibly powerful. \n\nOne of my students who works particularly quickly expressed that he wished there was more room for differentiation. Next time, I will be adding a “when you’re done” section on the running Google Document that will allow the student to know immediately what they can work on when they’re done with the task at hand. This will also likely come with an ask to type “Working on Bonus Work now!” In the chat box.\n\nI still have a lot of questions, but I am incredibly glad to have hosted this virtual classroom sooner rather than later. I showed students who attended that I will do my best to create a semblance of consistency during these uncertain times, and that they have my unwavering support. Further, after hosting my first class, I am excited to now be in a space of reflection and iteration, over the detrimental space of analysis paralysis.\n\n### **Share your learnings with your teacher networks, or with us.**\n\nEquity is a huge question that has been on my mind these past two weeks, and I am often discouraged to think about how existing inequities will likely  be exacerbated over the next couple of months. In my own experience and in the experiences of teachers I’ve spoken to recently, many students who require much more support in the classroom are being left behind in this model of remote learning.\n\n**If you have any thoughts or ideas (halfbaked, fullbaked, effective, or valiantly effortful) around how we can support struggling students during this time, we would love to hear about them!**",
    "created_at": "2020-03-22T21:09:34.072Z",
    "updated_at": "2020-03-24T05:14:20.789Z",
    "blurb": "In this post, Ingrid shares her three biggest takeaways & tips from leading her first remote class with students through Google Hangouts.",
    "user": {
      "id": 2,
      "username": "whalecake",
      "email": "ang.ingrid@gmail.com",
      "provider": "local",
      "confirmed": true,
      "blocked": false,
      "role": 1,
      "created_at": "2020-03-23T03:15:54.440Z",
      "updated_at": "2020-03-23T15:09:17.822Z",
      "fullname": "Ingrid Ang",
      "avatar": [
        {
          "id": 8,
          "name": "ingrid.jpeg",
          "hash": "3c9477db0de14a98ba7966883a53b42a",
          "sha256": "zoYzpGLYFxYQpw7nrmfvGWYSsIGo0QZzkRwbcn_3zok",
          "ext": ".jpeg",
          "mime": "image/jpeg",
          "size": 9.75,
          "url": "https://distance-school.s3.us-west-2.amazonaws.com/3c9477db0de14a98ba7966883a53b42a.jpeg",
          "provider": "aws-s3",
          "provider_metadata": null,
          "created_at": "2020-03-23T15:09:18.294Z",
          "updated_at": "2020-03-23T15:09:18.294Z"
        }
      ]
    },
    "image": null
  }
]
